<a href="https://colab.research.google.com/github/alexsandro-matias/lab_dio/blob/main/aula04_Trabalhando_arquivos_Excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Utilizando Arquivo do Excel para Análise de Dados

## Lendo os arquivos e depois mesclando-os

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel("/content/Aracaju.xlsx")
df2 = pd.read_excel("/content/Fortaleza.xlsx")
df3 = pd.read_excel("/content/Natal.xlsx")
df4 = pd.read_excel("/content/Recife.xlsx")
df5 = pd.read_excel("/content/Salvador.xlsx")

Mesclando as coleções de Dados

In [3]:
df = pd.concat([df1,df2,df3,df4,df5])

In [4]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

Para uma amostragem aleatória do dataframe.

In [6]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
6     Salvador 2019-01-01   36.30    1034     2
40   Fortaleza 2019-02-13   19.13    1002     4
109    Aracaju 2018-01-01   51.64    1523     5
134  Fortaleza 2019-03-02  195.18     980     5
112      Natal 2019-01-02   43.00    1036     3
135     Recife 2019-03-02   10.79     983     5
218      Natal 2019-01-02  189.12    1036     3
148      Natal 2019-01-02   40.59    1037     3
163      Natal 2019-01-02   17.66    1036     3
125    Aracaju 2018-01-01   15.62    1522     2

Neste exemplo, como os ID's das lojas não sofrerão nenhum cálculo, esses serão convertidos para o tipo texto.

In [7]:
df['LojaID'] = df['LojaID'].astype("object")

Para testar o efeito, verificaremos o tipo dos ID's:

In [8]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

# Verificando valores nulos ou faltantes

Primeiramente, verificando os valores faltantes:

In [11]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    5
LojaID    0
Qtde      0
dtype: int64

Como foram mostrados dados faltantes. Neste contexto, várias abordagens podem ser adotadas. Uma delas é a exclusão desses valores; já outra, a que será abordada neste caso, será executada a média dos valores e depois atribuída aos valores faltantes.

In [13]:
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

Verificando se os valores forem preenchidos:

In [14]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

Caso fosse utilizada a abordadem de substituição de zero pelos valores faltantes, poderia feita da seguinte forma:

In [15]:
df["Vendas"].fillna(0, inplace=True)

Para exclusão dos registros que estivessem com valores faltantes:

O parâmetro inplace = True, faz com que haja uma substituição do objeto depois de executados os métodos. Caso seja marcado com **false**, haverá a visualização dos dados com os métodos porém no objeto em memória não será alterado.

In [ ]:
df.dropna(inplace=True)